{"ref": "https://stephenking.com/darktower/", 
"content": "The Dark Tower Official Website is an ever-expanding resource of all things Dark Tower. Within these pages, you will find vast amounts of content that include standard archival information in addition to all the latest news on books, comics, and related works. THE BOOKS The Dark Tower series tells the story of Roland Deschain, Mid-World’s last gunslinger, who is traveling southeast across Mid-World’s post-apocalyptic landscape, searching for the powerful but elusive magical edifice known as The Dark Tower. Located in the fey region of End-World, amid a sea of singing red roses, the Dark Tower is the nexus point of the time-space continuum.  It is the heart of all worlds, but it is also under threat. Someone, or something, is using the evil technology of the Great Old Ones to destroy it. Inspired in equal parts by Robert Browning’s poem, “Childe Roland to the Dark Tower Came,” J.R.R. Tolkien’s Lord of the Rings, and Sergio Leone’s spaghetti Western classics, The Dark Tower series is an epic of Arthurian proportions. It is Stephen King’s magnum opus, and is the center of his amazing creative universe. THE COMICS The Dark Tower comics follow the adventures and trials of Roland Deschain, son of Steven Deschain, dinh of Gilead.  At the outset of our tale, Roland is a fourteen-year-old gunslinger apprentice, goaded by his father’s treacherous sorcerer into taking his test of manhood years too early.  Roland thinks that  he is fighting for his father’s honor, but in truth Marten Broadcloak is in league with Gilead’s enemy, John Farson, and wants nothing less than to have Roland—the final descendant of Arthur Eld, the ancient King of All-World—sent west in disgrace.  Roland wins his guns, but the price is high. With Farson’s assassins haunting the streets of Gilead, Roland and his tet-mates Cuthbert Allgood and Alain Johns must leave the city. Steven Deschain sends the boys to the Outer Arc town of Hambry, but Roland and his tet-mates soon discover that Hambry is not a quiet backwater but the heart of Farson’s war-machine—an obliterating juggernaut which has its sights set on Gilead. So begins the epic war between Roland’s gunslingers and John Farson’s forces, a conflict whose battlefield moves from the Outer Arc to In-World and finally to the gunslingers’ heroic but doomed last stand at the Battle of Jericho Hill. Over the course of the story, Roland transforms from the dinh of a faithful ka-tet to a war-hardened loner, searching for the Dark Tower and for his ultimate enemies—a many-faced sorcerer and his master, an immortal were-spider who wants nothing less than to destroy the Tower and swallow the wreckage of the multiverse. DISCORDIA Discordia allows its users to explore virtual worlds faithfully created using the descriptions within The Dark Tower series, and now includes new content and gameplay for 2017. Discordia has been updated for the modern web, runs without Flash, and is playable in most modern browsers. WARNING: Discordia contains spoilers and has been designed for fans who've already read The Dark Tower.",
"date":" "}