{"ref": "https://stephenking.com/darktower/book/", 
"content": "THE BOOKS EXPLORE THE WORLD OF THE DARK TOWER The Dark Tower comics follow the adventures and trials of Roland Deschain, son of Steven Deschain, dinh of Gilead. At the outset of our tale, Roland is a fourteen-year-old gunslinger apprentice, goaded by his father’s treacherous sorcerer into taking his test of manhood years too early. Roland thinks that he is fighting for his father’s honor, but in truth Marten Broadcloak is in league with Gilead’s enemy, John Farson, and wants nothing less than to have Roland—the final descendant of Arthur Eld, the ancient King of All-World—sent west in disgrace. Roland wins his guns, but the price is high. With Farson’s assassins haunting the streets of Gilead, Roland and his tet-mates Cuthbert Allgood and Alain Johns must leave the city. Steven Deschain sends the boys to the Outer Arc town of Hambry, but Roland and his tet-mates soon discover that Hambry is not a quiet backwater but the heart of Farson’s war-machine—an obliterating juggernaut which has its sights set on Gilead. So begins the epic war between Roland’s gunslingers and John Farson’s forces, a conflict whose battlefield moves from the Outer Arc to In-World and finally to the gunslingers’ heroic but doomed last stand at the Battle of Jericho Hill. Over the course of the story, Roland transforms from the dinh of a faithful ka-tet to a war-hardened loner, searching for the Dark Tower and for his ultimate enemies—a many-faced sorcerer and his master, an immortal were-spider who wants nothing less than to destroy the Tower and swallow the wreckage of the multiverse. THE DARK TOWER: THE GUNSLINGER BORNFEBRUARY 2007 The Gunslinger Born is an adaptation of Stephen King’s fourth Dark Tower novel, Wizard and Glass. It tells the story of Roland Deschain, a gunslinger apprentice who is goaded by his father’s treacherous sorcerer into facing his coming-of-age test at the unheard-of age of fourteen. Although Marten hopes that Roland will fail and be sent west in disgrace, Roland wins his guns and becomes a fully fledged gunslinger. But Roland’s victory puts his life in even more danger. Determined to save his son from Gilead’s many secret assassins, Steven Deschain sends Roland and two tet-mates on a mission to the Outer Arc town of Hambry. Posing as drovers, Roland, Cuthbert, and Alain must discover whether Hambry’s powerful Horsemen’s Association is still loyal to Gilead. But when Roland embarks on a forbidden affair with Susan Delgado, the mayor’s future jilly, he discovers that Hambry is not the safe backwater that his father thought it to be. Like the evil seeing sphere that the town’s ancient witch hides beneath the floorboards of her bedroom, all of Hambry has sold its soul to Gilead’s enemies. THE DARK TOWER: THE LONG ROAD HOMEMARCH 2008 Accused of treason, Roland’s lover Susan Delgado has been burned on a Charyou Tree fire. Despite his grief, Roland must now travel as fast as he can to Gilead, so that he can deliver the dangerous seeing sphere, Maerlyn’s Grapefruit, to his father. But the treacherous Grapefruit has its own plans and traps Roland’s consciousness within its dangerous pink dreamscape. While our hero battles the demonic beings within the Grapefruit, Cuthbert Allgood and Alain Johns must face the dangers of the long road home to Gilead, all the while guarding their young  dinh’s body against the human and mutant forces conspiring to destroy them all. THE DARK TOWER: TREACHERYSEPTEMBER 2008 Roland, Cuthbert, and Alain have returned safely to Gilead . . . or have they? Roland is still enslaved by Maerlyn’s Grapefruit, and he refuses to tell his father about the sphere’s existence. Cuthbert and Alain have been declared gunslingers, but now must face the raging jealousy of their fellow apprentices who feel that Roland’s tet-mates have won their guns dishonestly. Steven Deschain is gladly awaiting the return of his wife, Gabrielle Deschain, who seems to have renounced her former lover, Marten Broadcloak, enemy of Gilead. But Gabrielle’s illicit love is too strong to renounce, and she sets off a chain of events that prove disastrous for herself, for Roland, and for Gilead. THE DARK TOWER: THE FALL OF GILEADMAY 2009 Tricked by the  glammer of the evil seeing sphere known as Maerlyn’s Grapefruit, Roland has murdered his mother. But while Roland awaits trial, Farson’s forces infiltrate the city. One by one, the elder gunslingers are assassinated. Now Roland and his tet-mates must defend the city by themselves. Our friends are greatly outnumbered. The secret weapons built into the city by Arthur Eld himself may prove their only salvation.",
"date": "2007-01-01"}