{"ref": "https://stephenking.com/darktower/book/", 
"content": "The Dark Tower series tells the story of Roland Deschain, Mid-World’s last gunslinger, who is traveling southeast across Mid-World’s post-apocalyptic landscape, searching for the powerful but elusive magical edifice known as The Dark Tower. Located in the fey region of End-World, amid a sea of singing red roses, the Dark Tower is the nexus point of the time-space continuum. It is the heart of all worlds, but it is also under threat. Someone, or something, is using the evil technology of the Great Old Ones to destroy it. In Roland’s where and when, the world has already begun to move on. Time and direction are in drift, and the fabric of reality is fraying. However, things are about to get much worse. The six invisible magnetic Beams, which maintain the alignment of time, space, size, and dimension, are weakening. Because of this, the Tower itself is foundering. Unless Roland can find a way to save the Beams and stabilize the Tower, all of reality will blink out of existence. Inspired in equal parts by Robert Browning’s poem, “Childe Roland to the Dark Tower Came,” J.R.R. Tolkien’s Lord of the Rings, and Sergio Leone’s spaghetti Western classics, The Dark Tower series is an epic of Arthurian proportions. It is Stephen King’s magnum opus, and is the center of his amazing creative universe. THE DARK TOWER I: THE GUNSLINGERDONALD M. GRANT, PUBLISHER 1982 The Man in Black fled across the desert, and the gunslinger followed. So begins Book I of Stephen King’s iconic fantasy series, The Dark Tower. Part sci-fi novel, part futuristic dystopia, part spaghetti Western, and part high fantasy vision, The Gunslinger tells the story of Roland Deschain, Mid-World’s last gunslinger, who is tracking an enigmatic magician known only as the man in black. Following his quarry across the demon-infested Mohaine Desert, Roland confronts a mad preacher woman and her murderous flock, holds palaver with a speaking demon, and finally befriends a young boy from our world named Jake Chambers. Jake joins Roland on his quest, but while Roland travels with his young companion Jake, the man in black travels with Roland’s soul in his pocket. THE DARK TOWER I: THE GUNSLINGER (REVISED)VIKING PRESS JUNE 2003 The Man in Black fled across the desert, and the gunslinger followed. So begins Book I of Stephen King’s iconic fantasy series, The Dark Tower. Part sci-fi novel, part futuristic dystopia, part spaghetti Western, and part high fantasy vision, The Gunslinger tells the story of Roland Deschain, Mid-World’s last gunslinger, who is tracking an enigmatic magician known only as the man in black. Following his quarry across the demon-infested Mohaine Desert, Roland confronts a mad preacher woman and her murderous flock, holds palaver with a speaking demon, and finally befriends a young boy from our world named Jake Chambers. Jake joins Roland on his quest, but while Roland travels with his young companion Jake, the man in black travels with Roland’s soul in his pocket. The 2003 revised edition of The Gunslinger contains the essay On Being Nineteen (And a few other things) by Stephen. THE DARK TOWER II: THE DRAWING OF THE THREEDONALD M. GRANT, PUBLISHER MAY 1987 After his final confrontation with the Man in Black in a remote mountain Golgotha, an exhausted Roland awakes on the beach of the Western Sea and is immediately attacked by a shoreline monster known as a lobstrosity. Roland kills the clawed creature, but not before it bites off two of his fingers and half of one big toe. Fighting off the delirium brought on by the lobstrosity’s poison, Roland forces himself along the beach where he discovers three freestanding doorways that lead into our world. The first opens onto New York, 1987, and the mind of a heroin addict called Eddie Dean. The second leads to 1964 and the divided personality of Odetta Holmes/Detta Walker, an African American woman who has lost the bottom half of her legs but gained a second, psychotic self. The third door leads to 1977 and the mind of a psychopath called The Pusher, the very criminal responsible for Odetta’s injuries. Roland’s task is to make Eddie and Odetta into gunslingers before raging Detta destroys them all, and before the Pusher can continue his bloody killing spree. THE DARK TOWER III: THE WASTE LANDSDONALD M. GRANT, PUBLISHER AUGUST 1991 Several months have passed, and Roland’s two new tet-mates have become proficient gunslingers. Eddie Dean has given up heroin, and Odetta’s two selves have joined, becoming the stronger and more balanced personality of Susannah Dean. But while battling The Pusher in 1977 New York, Roland altered ka by saving the life of Jake Chambers, a boy who—in Roland’s where and when—has already died. Now Roland and Jake exist in different worlds, but they are joined by the same madness: the paradox of double memories. Roland, Susannah, and Eddie must draw Jake into Mid-World then follow the Path of the Beam all the way to the Dark Tower. But nothing is easy in Mid-World. Along the way our tet stumbles into the ruined city of Lud, and are caught between the warring gangs of the Pubes and the Grays. The only way out of Lud is to wake Blaine the Mono, an insane train that has a passion for riddling, and for suicidal journeys. THE DARK TOWER IV: WIZARD AND GLASSDONALD M. GRANT, PUBLISHER NOVEMBER 1997 Roland, Eddie, Susannah, Jake, and Jake’s pet bumbler survive Blaine the Mono’s final crash, only to find themselves stranded in an alternate version of Topeka, Kansas, one that has been ravaged by the superflu virus. While following the deserted I-70 toward a distant glass palace, they hear the atonal squalling of a thinny, a place where the fabric of existence has almost entirely worn away. While camping near the edge of the thinny, Roland tells his ka-tet a story about another thinny, one that he encountered when he was little more than a boy. Over the course of one long magical night, Roland transports us to the Mid-World of long-ago and a seaside town called Hambry, where Roland fell in love with a girl named Susan Delgado, and where he and his old tet-mates Alain and Cuthbert battled the forces of John Farson, the harrier who—with a little help from a seeing sphere called Maerlyn’s Grapefruit—ignited Mid-World’s final war. THE DARK TOWER IV S: THE WIND THROUGH THE KEYHOLESCRIBNER APRIL 2012 Although it is officially the eighth book of the Dark Tower saga, Stephen King likes to call The Wind Through the Keyhole book 4.5 of the series, since it takes place after our tet escapes the Green Palace at the end of Wizard and Glass, and before they reach Calla Bryn Sturgis, setting for Wolves of the Calla. The Wind Through the Keyhole is a story within a story within a story. At the outset, Roland and his American tet are traveling toward the River Whye in Mid-World. A great storm, called a Starkblast, is about to blow. While our tet is sheltering from the storm, Roland tells a story about his younger days, when he and his tet-mate Jamie DeCurry were sent to Debaria to investigate reports of a skin-man, a kind of dangerous shape-changer. While trying to comfort a young boy named Bill Streeter—the only survivor of a particularly brutal attack by the skin-man, and Roland’s only witness to the crime—Roland recounts yet another story. This time it is a sinister fairytale drawn from the book Magic Tales of Eld. The three stories are woven together by the freezing, howling winds of the Starkblast. THE DARK TOWER V: WOLVES OF THE CALLASCRIBNER NOVEMBER 2003 Roland and his tet have just returned to the path of the Beam when they discover that they are being followed by a group of inexperienced trackers. The trackers are from the town of Calla Bryn Sturgis, and they desperately need the help of gunslingers. Once every generation, a band of masked riders known as the Wolves gallop out of the dark land of Thunderclap to steal one half of all the twins born in the Callas. When the children are returned, they are  roont, or mentally and physically ruined. In less than a month, the Wolves will raid again. In exchange for Roland’s aid, Father Callahan—a priest originally from our world—offers to give Roland a powerful but evil seeing sphere, a sinister globe called Black Thirteen which he has hidden below the floorboards of his church. Not only must Roland and his tet discover a way to defeat the invincible Wolves, but they must also return to New York so that they can save our world’s incarnation of the Dark Tower from the machinations of the evil Sombra Corporation THE DARK TOWER VI: SONG OF SUSANNAHSCRIBNER JUNE 2004 The Wolves have been defeated, but our tet faces yet another catastrophe. Susannah Dean’s body has been usurped by a demon named Mia who wants to use Susannah’s mortal form to bear a demon child. Stealing Black Thirteen, Mia has traveled through the Unfound Door to 1999 New York where she plans to give birth to her chap, a child born of two mothers and two fathers who will grow up to be Roland’s nemesis. With the help of the time-traveling Manni, Roland and Eddie plan to follow Susannah while Father Callahan and Jake will find Calvin Tower, owner of the vacant lot where a magical rose grows: a rose that must be saved at all costs. But despite our ka-tet’s intentions, ka has its own plans. Jake, Callahan, and Jake’s bumbler companion are transported to New York to follow Susannah, while Eddie and Roland are tumbled into East Stoneham, Maine, where they are greeted by Eddie’s old enemy, the gangster Balazar. But it isn’t just bullets that Roland and Eddie must brave. Soon they will meet their maker, in the form of a young author named Stephen King. THE DARK TOWER VIISCRIBNER SEPTEMBER 2004 At the outset of the final installment of our saga, Roland’s ka-tet is scattered across several different  wheres and whens. Susannah Dean (still in the clutches of the demon Mia) is in End-World’s Fedic Dogan: a chamber of horrors where magic and technology can be merged and where a monstrous half-human child can be brought forth into the world. Eddie Dean and Roland Deschain are in Maine, 1977, searching for the site of otherworldly walk-in activity, and a possible doorway back to Mid-World. Jake Chambers, Father Callahan, and the bumbler Oy are battling vampires and low men in New York’s Dixie Pig Restaurant, circa 1999, a place where long pig is definitely on the menu. As soon as our tet reunites, they must journey to the headquarters of Thunderclap’s Wolves in order to discover exactly why the Crimson King’s minions have been culling the brains of young children for twin-telepathy enzymes. The answer is more horrible than they realized, and bears directly upon Roland’s quest to reach the Dark Tower. LITTLE SISTERS OF ELURIA (SHORT STORY) “The Little Sisters of Eluria” is a prequel to the first volume of the Dark Tower saga. Roland’s beloved city of Gilead has fallen to the Good Man’s forces, and the Gunslingers have been slaughtered at the Battle of Jericho Hill. Roland is now a lone wanderer, searching for the trail of the elusive sorcerer known as the Man in Black. On a hot day during the season of Full Earth, Roland enters a deserted town in the Desatoya Mountains. The town is called Eluria, and it is empty except for a lame dog, a drowned boy, and the eerie sound of tinkling silver bells. As Roland searches for the town’s missing inhabitants, he is attacked by the slow mutants known as the Green Folk. Our unconscious hero is rescued by an itinerant band of female healers who call themselves the Little Sisters of Eluria. But Roland’s rescuers are not what they seem, and our gunslinger must fight their narcotic potions to stay awake, and alive. CHARLIE THE CHOO-CHOONOVEMBER 2016 Engineer Bob has a secret: His train engine, Charlie the Choo-Choo, is alive…and also his best friend. From celebrated author Beryl Evans and illustrator Ned Dameron comes a story about friendship, loyalty, and hard work.",
"date": "1982-12-12"}