{"ref": "https://stephenking.com/faq/", 
"content": "Frequently Asked Questions General Writing The Dark Tower Rumors Other Books and Movies The Plant Kingdom Hospital Dollar Baby Films Message Board General  I received spam from your site. What should I do?  How can I find out if you're going to be doing any book signings or appearances?  How can I tell if I have a First Edition?  How do I join your fan club?  What is your religion? What is your email address?  When is your birthday? What is your political affiliation?  Do you have a Facebook page? What are your thoughts on censorship and book banning?  What do the dates mean at the end of your book? Writing Why did you become a writer? Where do you get your ideas?  Do you accept story ideas? Will you read my manuscript and tell me what you think?  I need an agent/publisher, can you tell me the name of a good one? Where can I submit my assignment from On Writing?  Why did you write books as Richard Bachman? Where would be a good place to send my writing?  Can you give me some writing tips? Do you teach any courses or seminars? The Dark Tower Is The Dark Tower going to be made into a video game?  Why did my copy of Wolves of the Calla turn my hands black? Rumors Is it true you've been in all of your films?  How can I get your autograph?  Are you dead?  I saw on an unofficial website that Stephen King will sign photographs. Is it true that you're going blind?  Is it true that you have retired?  Is it true that you have an annual campfire ghost story event?  Do you really have a haunted house at your home on Halloween? Other Books and Movies In Dreamcatcher what do the letters SSDD mean?  Are there any plans to publish a novel or a screenplay of Rose Red?  Do you plan to write a sequel to Salem's Lot?  Who really wrote The Diary of Ellen Rimbauer? Is the movie Insomnia based on your book?  In the Princess Bride it says you're going to write the abridgement for Buttercup's Baby. Is that true?  Is there an audiobook of The Stand? The Plant Are you going to finish The Plant?  Where can I get The Plant? Kingdom Hospital Will there be a second season of Kingdom Hospital?  What are the songs that have been played?  Will there be a soundtrack CD released?  Who does the voice of the  Who does the voice of Charlie (Dave Hooman's Dog)?  Who does the voice of Antubis?  What is The Kingdom?  Who wrote The Journals of Eleanor Druse?  Dollar Baby FilmsWhat is a Dollar Baby? What are the requirements/prerequisites to option a story? Where can I find out what stories are available?  How can I make one?   Will I be provided with a script?  Can I put my short on the internet or sell it on DVDs?  Can I choose multiple stories?  Message Board How do I use the message board? ",
"date": " "}