{"ref": "https://stephenking.com", "content": "New Releases Release Date: September 29th, 2020 #1 New York Times bestselling author Stephen King’s beloved novella, Rita Hayworth and Shawshank Redemption—the basis for the Best Picture Academy Award–nominee The Shawshank Redemption—about an unjustly imprisoned convict who seeks a strangely satisfying revenge, is now available for the first time as a standalone book. A mesmerizing tale of unjust imprisonment and offbeat escape, Rita Hayworth and Shawshank Redemption is one of Stephen King’s most beloved and iconic stories, and it helped make Castle Rock a place readers would return to over and over again. Suspenseful, mysterious, and heart-wrenching, this iconic King novella, populated by a cast of unforgettable characters, is about a fiercely compelling convict named Andy Dufresne who is seeking his ultimate revenge. Originally published in 1982 in the collection Different Seasons  it was made into the film The Shawshank Redemption in 1994. Starring Morgan Freeman and Tim Robbins, this modern classic was nominated for seven Academy Awards, including Best Picture, and is among the most beloved films of all time. The Stand Release Date: December 17th, 2020 THE STAND is Stephen King’s apocalyptic vision of a world decimated by plague and embroiled in elemental struggle between good and evil. The fate of mankind rests on the frail shoulders of the 108-year-old Mother Abagail and a handful of survivors. Their worst nightmares are embodied in a man with a lethal smile and unspeakable powers: Randall Flagg, the Dark Man. The series will be produced by CBS Television Studios. Josh Boone and Ben Cavell will write and executive produce, with Boone also directing. Stephen King will write the last chapter of the series, providing a new coda that isn’t found in the book. Roy Lee, Jimmy Miller and Richard P. Rubinstein will also serve as executive producers with Will Weiske serving as co-executive producer. Knate Lee, Jill Killington and Owen King will serve as producers. THE STAND premieres on CBS All Access December 17th, 2020. The show will be available on Starzplay for much of Europe, HBO Nordic, HBO Portugal, M-NET in Africa, Cosmote TV in Greece, Síminn in Iceland, Wavve and Tcast Co., Ltd in Korea, Amediatek in Russia, Israel’s Yes and Voot Select in India.",
"date": "2020-29-09" }