{"ref": "https://stephenking.com/news/", 
"content": "12 Days of Stephen King Sweepstakes Posted: December 7th, 2020 9:49:24 pm This sweepstakes has ended. Scribner, Stephen's US publisher, is sponsoring a sweepstakes in which one Grand Prize winner will receive a collection of Stephen King ebooks and audio downloads and two face masks. Ten runners-up will receive an ebook edition of If It Bleeds and It and two face masks. Enter until December 19th at 11:59pm EDT. ENTER NOW The sweepstakes is US-only, and you can see THE OFFICIAL RULES HERE. 2020 Google Play Best of 2020 Awards Posted: December 3rd, 2020 1:15:31 am The Google Play Best of 2020 awards are here and If It Bleeds is the User’s Choice Book of 2020! CHECK OUT THE FULL LIST HERE. Aidditionally, the audiobook edition of If It Bleeds, read by Steven Weber, Will Patton, and Danny Burstein has been selected as one of Google Play’s Best of 2020! YOU CAN FIND MORE OF THE BEST AUDIOBOOKS OF 2020 HERE. 2020 Goodreads Choice Awards Finals Posted: November 25th, 2020 9:52:27 am If It Bleeds has progressed to the finals for a 2020 Goodreads Choice Award for Best Horror. Head over to Goodreads to see the competition and cast your vote before the voting ends on November 30th! GOODREADS BEST HORROR NOMINEES 2020 Goodreads Choice Awards Posted: November 20th, 2020 5:46:48 pm If It Bleeds has been nominated for a 2020 Goodreads Choice Award for Best Horror. Head over to Goodreads to see the competition and cast your vote. GOODREADS BEST HORROR NOMINEES LATER Excerpt Posted: November 20th, 2020 5:44:50 pm Can't wait until March 2nd, 2021 for Later? Head over to Entertainmment Weekly's website for an excerpt. READ NOW Interview in EW Posted: October 15th, 2020 12:51:11 pm EW spoke with King about Mr. Mercedes, The Stand,  and The Outsider ... and, of course, dipped a bit into politics as well. READ THE INTERVIEW NOW ON EW.COM THE STAND: Official Trailer Posted: October 15th, 2020 12:44:10 pm THE STAND will premiere on CBS All Access on December 17th, 2020, but you can view the official trailer now. WATCH NOW ON YOUTUBE MR. MERCEDES on Peacock Posted: October 15th, 2020 12:41:22 pm The first two seasons of MR. MERCEDES can now be streamed for free on Peacock. START WATCHING NOW Mr. Mercedes Headed to Peacock Posted: September 21st, 2020 2:59:38 pm PEACOCK is officially picking up Mr. Mercedes for its third season. Seasons 1 and 2 of Mr. Mercedes will stream exclusively on Peacock and will be available on October 15th. The premiere date for Season 3 is TBD.",
"date": "2020-12-7"}