{"ref": "https://stephenking.com/upcoming/", 
"content": "Upcoming Works Novels TV NovelsLater Release Date: March 2nd, 2021 SOMETIMES GROWING UP MEANS FACING YOUR DEMONS The son of a struggling single mother, Jamie Conklin just wants an ordinary childhood. But Jamie is no ordinary child. Born with an unnatural ability his mom urges him to keep secret, Jamie can see what no one else can see and learn what no one else can learn. But the cost of using this ability is higher than Jamie can imagine—as he discovers when an NYPD detective draws him into the pursuit of a killer who has threatened to strike from beyond the grave. LATER is the third book Stephen King has written for Hard Case Crime. Both of the previous two, THE COLORADO KID and JOYLAND, were New York Times bestsellers.Stephen King commented, I love the Hard Case format, and this story—combining a boy who sees beyond our world and strong elements of crime and suspense—seemed a perfect fit. LATER is a beautiful story about growing up and facing your demons -- whether they’re metaphorical or (as sometimes happens when you’re in a Stephen King novel) the real thing,” said Charles Ardai, the Edgar Award-winning editor of Hard Case Crime. “It’s terrifying, tender, heartbreaking and honest, and we’re so excited to bring it to readers. LATER will be published initially as a paperback original, featuring an original cover painting by Paul Mann. This edition will be followed by a limited-edition hardcover that will feature two new cover paintings by award-winning artist Gregory Manchess, one for LATER itself and one for a fictitious novel within the novel that features prominently in the plot. An ebook edition of LATER will also be available. Lisey's Story Release Date: To Be Determined Lisey`s Story is an upcoming miniseries based on the 2006 novel of the same name. Written by Stephen King, produced by J. J. Abrams and directed by Pablo Larrain, the series features Julianne Moore as Lisey Landon, Clive Owen as Scott Landon, Joan Allen as Amanda Debuher, Dane DeHaan as Jim Dooley, Sung Kang as Officer Dan Boeckman and Jennifer Jason Leigh.While the series release date has yet to be announced, you can find THE NOVEL wherever books are sold.",
"date": "2021-03-02"}